import Para from './para_calendars.mjs'
const d2r = d => d * Math.PI / 180
const r2d = r => r * 180 / Math.PI
// 第谷歲實 365.2421875，每日平行59+8/60+19/60^2+49/60^3+51/60^4+39/60^5=59.1388419483，即0.9856473658°，
// 後編 365.2423344201415，每日59+8/60秒+19/60^2微+44/60^3纖+43/60^4忽+22/60^5芒+3/60^6塵，即0.98564696935128225°
// 至於歲實消長，新法算書雖爲之說，而實未用其數
// 黃赤距緯 第谷23+31/60+30/60^2，康熙測得23+29/60+30/60^2。諸家前多後少，可能因為蒙氣差不同，再細察，黃赤距度古今實有不同。後編用噶西尼23+29/60

// atmospheric refraction 蒙气差
// 蒙氣差：視線常高、光線常卑。測得地平蒙氣差爲32′19″，蒙氣之厚爲地半徑6095/10000000，sin戊=10000000/10006095=0.999390871，∠己戊庚=88°42/100′，∠丁戊庚=88°42/100′+32′19″=88°32′19.42″，sin丁戊庚=0.999674825。0.999674825/0.999390871=1.0002841。
// 假設地平上20°，tan70=2.7474774195，(x+10000000)^2+(tan70x)^2=10006095^2，
// 公式1。 h:星體高度。(tan(90-h)^2+1)x^2+2x+10000000^2-10006095^2=0
// sin(69.90432+20)*10006095-10000000=6081
// ∠甲戊乙=∠癸戊丑=69°54′15.55″=69.90432°，sin∠子戊丑=sin(69.90432°)*1.0002841，得∠子戊丑=69°56′55.92″=69.94887°，69°56′55.92″-69°54′15.55″=2′40.37″
const atmos = h => {
    const a = Math.tan(d2r(90 - h)) ** 2 + 1
    const delta = 4 + 4 * a * 2.0006095 * 0.0006095
    const x = 1e7 * (-2 + Math.sqrt(delta)) / (2 * a) // 根據公式1 ，一元二次方程求根公式
    const ang1 = r2d(Math.asin((1e7 + x) / 10006095)) - h
    const ang2 = r2d(Math.asin(Math.sin(d2r(ang1)) * 1.0002841))
    return ang2 - ang1
}
// console.log(atmos(20)) // 0.04453873130688635
// 地半径差：距地平近则大，在最卑距地心近、差角大。新法算書用哥白尼，AU=地半徑:中距日半徑=1:1142，地平上最大差3′。噶西尼日天半徑甚遠，只在微秒。選擇用火星與恆星相較、火星衝太陽時相較，得火星在地平上25.37′，太陽在中距地平10′，由此得中距AU=1:20626，最高20975，最卑20277，最高9′50″，最卑10′10″。
// 乙處火星距天頂∠火乙丙=59°40′15″，丁處15°47′5″，乙處火星與最近之恆星相距較丁處低15″。sin∠火乙丙=0.8631386，sin∠火丁戊=0.2720236，相減得一率=0.5911150。乙處火星地半徑差爲∠乙火心，丁處為∠丁火心，於是兩處地半徑差之較=∠乙火丁=15′。
// 兩處火星距天頂之正弦相減:地半徑差之較=10000000:地平上最大差∠乙壬心。
// sin∠乙壬心* 0.5911150=sin15″，sin∠乙壬心=0.0001230252285，∠乙壬心=。
// 甲癸=sin∠火乙丙*10000000=8631386
// 甲子=sin∠火丁戊*10000000=2720236
// 看了兩個小時多看不懂怎麼推的。
// 接下來太陽地平地半徑差，測得 火距:日距=100:266
// 又上編日躔求地半徑差法，更繁複的推導方法。∠丙心戊=43°52′55″，2sin(1/2 ∠心)=0.7473023=乙丁。∠乙=∠丁=68°3′32″30'''⋯⋯

// 用橢圓面積爲平行
// 郭守敬盈縮最大差2°22′，新法算書第谷2°3′11″，新法算書2°3′9″40'''，兩心差358416.刻白爾1°56′12″ 
// 角度與積度之較，即平行實行之差。高卑之盈縮差與均輪合，中距與本輪均輪皆合。

// 求兩心差及橢圓與平圓之比例
// 今測中距盈縮差1°56′12″，折半SΔ甲乙戊=58′6″=∠乙戊甲，檢其正弦得兩心差169000，倍之338000。甲戊=大半徑1000萬，得甲乙爲勾=169000，弦10000000，得股9998571.8480191爲小半徑。正弦角度面積:平圓=小半徑:平圓半徑
// 逐度割之，橢圓之餘弦必與平圓之餘弦相等，橢圓之正弦必小於平圓之正弦，平圓正弦:橢圓正弦=平圓半徑:橢圓小半徑
// 卷一葉37，已知平圓60度弧，求橢圓的角。卯辰:己辰=大半徑:小半徑=tan卯乙辰:tan己乙辰，得tan己乙辰=0.17318034，己乙辰=59°59′47″，相較即橢圓差角。
// 又設己甲辰=60°50′32″，求卯甲辰。己辰:卯辰=小半徑:大半徑=tan己甲辰:tan卯甲辰，tan己甲辰=0.17923897，得tan卯甲辰=0.17926457，卯甲辰=60°54′45″
// S平圓:S橢圓=S平圓外切正方形:S橢圓外切長方形=大徑:小徑
// 求橢圓大小徑之中率
// 按大小徑中率作圓。設乙申爲中率=9999285.89，則中率圓與平圓外切方面積比例=二圓面積比例，S中率外切方=S橢圓外切長方=399,942,873,920,764 （書中未說近似相等，由後可見是近似，因為大小徑很接近，可以近似），由方得圓面積S中率圓=314114398282337，（按橢圓面積公式算得314,114,398,641,265.272339169。）除以360，每度872539995229，橢圓每分面積也是這個數。
// 橢圓角度與面積相求
// 先以角求積（以實行度求平行度）。日甲丁=實行60度，sin60=0.8660254，倍兩心差338000，求得丙壬292716.59。求得甲壬169000。求得甲辛=9913375.87。求得辛癸8585235.30，（接著求癸甲、癸乙，）求得子癸。據正弦得∠乙=59°9′53.69″。⌒子丁=10326225.4784009″，S子丁平分圓=⌒子丁*10000000=51631127392005。（S辛丁分橢圓:S子丁平分圓=小徑:大徑，沒想到居然猜對了）S辛丁分橢圓=51623753692546。S∆甲乙辛=725452882850，得S甲辛丁分橢圓=50898300809696，得平行度⌒辛丁=58.333487°=58°20′0″30'''
// 又法略
// 又舉了個例子，但也是實行求平行。至於平行求實行，「法屬繁雜，故茲不載。」
// 以積求角。設甲辛丁爲平行1°分橢圓，甲丁^2=96648561000000，中率半徑^2=99,985,718,309,953.0921≒大徑*小徑=99985718480191，甲辛丁一度面積872539995229。設甲壬、甲癸爲中率，(甲丁:甲壬)^2=S甲辛丁:S甲癸壬，872539995229/(9,831,000/9999285.89)^2=902,667,740,465.7334621273。求得四率902,667,742,003，以一度面積除之，平行一度之實行度∠甲=902667742003/872539995229=1°2′4.30″。又捷法∠甲=(甲壬/甲丁)^2
// 又比如子在平行2°，Rt△辛丑丙、Rt△甲丑丙，已知∠甲，求得丙丑=6102.57，甲丑=337944.91，得辛丙10168973.37。此後步驟差不多。這樣是一度一度求。
// 借積求積。設平行∠辛乙丁=45°，S乙壬丁爲平分橢圓45度=39264299785292，得∠壬乙丁=44°59′45.27″，法見前（以角求積，暫時跳過）。作∠癸丙丁=∠壬乙丁，若S甲癸丁=S乙壬丁，則∠癸甲丁即平行45之實行度。已知sin∠癸丙丁=0.707056276，得甲子=238985.02，求得丙子=239019.16.得甲癸=9881935.54。得∠癸=1°23′8.79″。S甲癸丁和S乙壬丁相差S甲乙丑。∠癸甲丁=∠壬乙丁+∠癸=46°22′54.06″。求得癸辰=7154040.67。得己辰=7155062.52。得∠己乙丁=45°41′4.94″。得S乙己丁=39867426441874，求得S乙癸丁=39861732775367，S乙癸壬=S乙癸丁-S中率圓/8=597432990075。得S△乙癸寅，得S寅癸壬=7083446540=S甲乙丑。故S甲癸丁<45，實行在癸之前的午。S甲癸午=S寅壬癸，S甲午丁=S乙壬丁。根據以積求角的平方比例，(甲癸:中率)^2=S癸甲午:S未甲申，得∠未甲申=29.92″。相加得∠午甲丁=46°23′23.98″。此法乃合前二法兼用之，
// 又法更省便。設∠丙=45°，按上求得甲癸、∠癸甲丁⋯⋯
// 又設平行90°求實行。
// 又設平行120°。
// 借積求積法最為精密，但推算繁難，故用借角求角之法。
// 設∠丁乙辛=45°，S乙壬丁爲平分橢圓45°，∠癸乙子爲差角。已知tan∠丁乙辛=1，得tan∠丁乙癸=10000000/9998571.85=1.000142835，∠丁乙癸=45°0′14.73″。作丙丑∥乙癸，∠丙=∠丁乙癸，S甲丑丁≈S乙壬丁（原因在最後說的，S乙卯丁=S甲丑丁+S甲乙己，S甲乙己=S乙癸午⋯⋯太複雜了不看），∠丑甲丁即平行度。作輔助線，丑寅=甲丑，得∠寅=41′34.74″
// （葉80。用切線分外角法？？？我用自己的方法。甲寅^2=甲丙^2+丙寅^-2甲丙*甲寅cos丙=114,244,000,000+400,000,000,000,000-2*338,000*20000000*cos(45.00409°)，甲寅=19,762,460.4434621751，19,762,460.4434621751^2+20000000^2-2*20000000*19,762,460.4434621751*cos寅=338,000^2，cos∠寅=0.9999268576，∠寅=0.6929866698539219°=41′34.75″）
// 得∠甲丑丙=1°23′9.49″，實行度∠丑甲丁=46°23′24.22″
// 求均數
// 今求盈縮差用借角求角之法，與不同心天之法略同。平行——對倍兩心差之角、橢圓差角，相加減得均數。最卑爲初宮初度，最高為六宮初度。
// 平行積度±橢圓差角（<90°則+，>90°則-）=∠丙。∠丙+對倍差之角=實行，實行-平行=均數。
// 但是奇零不便立算，先以平行求對倍差之角，而後加減橢圓差角。設太陽在己，甲己丁爲分橢圓平行60度。實行在黃道爲申。甲己丁平分橢圓60度，∠己丙甲-橢圓差角∠未丙午=∠午丙甲=60°。所以先設∠甲丙午=60°，求得對甲丙倍差之午角=1°41′29″，∠午+∠甲丙午=∠午甲丁=61°41′29″。太陽實行在申，∠申甲辛=∠午甲丁+∠己甲午≈∠午甲丁+∠己丙午=61°41′29″+13″爲實行，1°41′29″+13″爲均數。

// A角angle，L线段line segment，O椭圆的一部分oval，C圆的一部分circle，S面积
const SunCorr = x => {
    const xMirror = 90 - Math.abs(90 - x)
    const a = 10_000_000, a2 = 20_000_000, b = 9_998_571.85, avg = 9_999_285.89, c = 169_000, c2 = 338_000, aSUBc = 9_831_000, aDIVb = 0.999857185 // 大小徑、avg中率、兩心差（焦距）。中距盈縮差1°56′12″。
    const SCavg = 314114398282337 // 中率圓面積
    // 求對甲丙倍差之午角：作輔助線延長丙午到寅。丙寅=甲午+丙午=2a，甲丙^2+丙寅^2-2甲丙*丙寅*cos甲丙寅=甲寅^2，求得甲寅。同理求得∠寅，∠午=2*∠寅。
    const Ljiayin = Math.sqrt((c2 ** 2 + a2 ** 2 - 2 * a2 * c2 * Math.cos(d2r(x))))
    const Awu = 2 * r2d(Math.acos((Ljiayin ** 2 + a2 ** 2 - c2 ** 2) / (2 * Ljiayin * a2)))
    // 求橢圓差角未丙午，見上文葉37條    
    const Aweibingwu = xMirror - r2d(Math.atan(aDIVb * Math.tan(d2r(xMirror))))
    let flag = 1
    if (x % 180 > 90) flag = -1
    return Awu + flag * Aweibingwu
}

// 推日躔
export default (CalName, year) => {
    const { Type, Sidereal, Anoma, Node, CloseOriginAd, Solar, Lunar, NodeCorr, FirstCorr, AnomaCorr, MansionCorr, WinsolsCorr, PeriCorr, PeriV, SunAvgV } = Para[CalName]
    const CloseOriginYear = year - CloseOriginAd // 積年
    const OriginAccumThis = CloseOriginYear * Solar // 中積
    const OriginAccumPrev = (CloseOriginYear - 1) * Solar
    const OriginAccumNext = (CloseOriginYear + 1) * Solar
    const WinsolsAccum = OriginAccumThis + WinsolsCorr // 通積分。
    const WinsolsMod = (WinsolsAccum % 60 + 60 + 1) % 60 // 天正冬至。甲子爲1
    // 求年根（考成：天正冬至次日子正初刻太陽距冬至之平行經度。天正冬至分：冬至距本日子正初刻後之分數與周日一萬分相減，餘爲冬至距次日子正初刻前之分數，故與每日平行為比例，得次日子正初刻太陽距冬至之平行經度）。一率：週日一萬分，二率：每日平行，三率：以天正冬至分與週日一萬分相減，求得四率爲秒，以分收之得年根。
    const WinsolsFrac = WinsolsAccum - Math.floor(WinsolsAccum) // 冬至小數
    const YearRoot = (1 - WinsolsFrac) * SunAvgV / 3600 // 年根。本來是分，我收作度。
    const WinsolsNextSc = (WinsolsSc + 1) % 60 // 求紀日：以天正冬至干支加一日得紀日。（考成：所求本年天正冬至次日之干支。既有天正冬至干支，可以不用紀日，因用表推算起於年根而不用天正冬至。若無紀日，則無以定干支，且日數自紀日干支起初日，故並用之）

    // 求值宿
    const OriginAccumMansion = OriginAccumThis + MansionCorr // 通積宿
    const Mansion = (OriginAccumMansion % 28 + 1 + 28) % 28 // 自初日角宿起算，得值宿。（考成：天正冬至乃冬至本日之干支，值宿乃冬至次日之宿，故外加一日。）
    // 求日數（考成：所求本日子正初刻距天正冬至次日子正初刻之平行經度。）。自天正冬至次日距所求本日共若干日，與太陽每日平行相乘，以宮度分收之，得日數。

    // 求平行。以年根與日數相加，得平行
}